INSERT INTO Album (name, release_year)
VALUES ('Би-2', 2000), ('Горизонт событий', 2018), ('Ночь короче дня', 1995), ('Штиль', 2002),
	('Крещение огнём', 2003), ('Акустический альбом', 1999), ('Лесник', 1994),
	('Ели мясо мужики', 1999), ('Перезагрузка', 2020), ('Вторая жизнь', 2020), ('Тропы', 2010),
	('Vinyl #1', 2018), ('Vinyl #2', 2020), ('Звезды и кресты', 2018), ('Реки времён', 2005),
	('По пояс в небе', 2006), ('Дышу тишиной', 2000), ('Декоративно-Прикладное искусство', 2020)

INSERT INTO Track (album_id, name, length_track)
VALUES (1, 'Варвара', 301), (2, 'Черное солнце', 290), (3, 'Возьми моё сердце', 253),
	(4, 'Беспечный ангел', 121), (5, 'Колизей', 389), (6, 'Кукла колдуна', 204), (7, 'Лесник', 192),
	(8, 'Ели мясо мужики', 134), (9, 'Молния', 181), (10, 'Dreams', 186), (11, 'Пташечка', 343),
	(12, 'Шарик', 186), (13, 'Рокки', 178), (14, 'Косово поле', 604), (15, 'Я здесь', 339),
	(16, 'На меньшее я не согласен', 262), (17, 'Мой друг', 302), (18, 'Переживу', 248)

INSERT INTO Singer (name)
VALUES ('Би-2'), ('Ария'), ('Король и шут'), ('Дима Билан'), ('Пелагея'), ('Zivert'),
	('Кипелов'), ('Николай Носков'), ('Монеточка')
	
INSERT INTO Genre (name)
VALUES ('Альтернативный рок'), ('Хеви-метал'), ('Фолк-рок'), ('Поп'), ('Инди-поп')

INSERT INTO Singer_Album 
VALUES (1, 1), (1, 2), (2, 3), (2, 4), (2, 5), (3, 6), (3, 7), (3, 8), (4, 9), (4, 10),
	(5, 11), (6,12), (6,13), (7, 14), (7, 15), (8, 16), (8, 17), (9, 18)

INSERT INTO Genre_Singer 
VALUES (1, 1), (2, 2), (3, 3), (4, 4), (3, 5), (4, 6), (2, 7), (4, 8), (5, 9)

INSERT INTO Collection (name, release_year)
VALUES ('Русский рок', 2006), ('Легенды русского рока', 2020), ('Танцевальные хиты', 2020),
	('100 лучших песен', 2018), ('Новинки 2020', 2020), ('КиШ. Лучшее', 2022),
	('Хеви-метал', 2022), ('Сборник pop-музыки', 2022)

INSERT INTO Collection_Track 
VALUES (1, 1), (1, 2), (1, 3), (1, 4), (1, 5), (1, 6), (1, 7), (1, 8), (1, 11), (1, 14), (1, 15),
	(2, 1), (2, 2), (2, 3), (2, 4), (2, 5), (2, 6), (2, 7), (2, 8), (2, 14), (2, 15),
	(3, 9), (3, 10), (3, 11), (3, 12), (3, 13), (3, 18),
	(4, 1), (4, 4), (4, 6), (4, 8), (4, 14), (4, 15), (4, 16),
	(5, 9), (5, 10), (5, 13), (5, 18), (6, 6), (6, 7), (6,8),
	(7, 3), (7, 4), (7, 5), (7, 14), (7, 15),
	(8, 9), (8, 10), (8, 12), (8, 13), (8, 16), (8, 17)